STMicroelectronics/OpenOCD/src/flash/nor/spc564b.c
/***************************************************************************
 *   Copyright (C) 2005 by Dominic Rath                                    *
 *   Dominic.Rath@gmx.de                                                   *
 *                                                                         *
 *   Copyright (C) 2008 by Spencer Oliver                                  *
 *   spen@spen-soft.co.uk                                                  *
 *                                                                         *
 *   Copyright (C) 2011 by Andreas Fritiofson                              *
 *   andreas.fritiofson@gmail.com                                          *
 *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program.  If not, see <http://www.gnu.org/licenses/>. *
 ***************************************************************************/

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "imp.h"
#include <helper/binarybuffer.h>
#include <target/algorithm.h>
#include <target/powerpc.h>
#include <target/target_type.h>
#include "spc56x.h"
#include "../../../contrib/loaders/flash/powerpc/spc56x.inc"

#define C_REG_BASE                 0xC3F88000
#define C_ARRAY_BASE               0x00000000
#define SHADOW_ROW_BASE            0x00200000
#define SHADOW_ROW_SIZE            0x00004000
#define FLASH_PAGE_SIZE    C90FL_PAGE_SIZE_08

typedef enum _c55_page_size
{
    C55_PAGE_SIZE_08  = 0x08,
    C55_PAGE_SIZE_16  = 0x10,
    C55_PAGE_SIZE_32  = 0x20
}  C55_PAGE_SIZE_TYPE;


struct spc564b_flash_bank {
	int probed;
	uint32_t user_bank_addr;
	uint32_t user_bank_size;

	uint32_t low_max_index;
	uint32_t mid_max_index;
	uint32_t high_max_index;
	uint32_t large_max_index;

	SSD_CONFIG ssd;
};

/* flash bank spc58xc <base> <size> 0 0 <target#> */
FLASH_BANK_COMMAND_HANDLER(spc564b_flash_bank_command)
{
	struct spc564b_flash_bank *spc564b_info;

	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	if (CMD_ARGC < 6)
		return ERROR_COMMAND_SYNTAX_ERROR;

	spc564b_info = malloc(sizeof(struct spc564b_flash_bank));
	bank->driver_priv = spc564b_info;

	spc564b_info->probed = 0;
	spc564b_info->user_bank_addr = bank->base;
	spc564b_info->user_bank_size = bank->size;

	return ERROR_OK;
}

static int spc564b_protect_check(struct flash_bank *bank)
{
	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);

	return ERROR_OK;
}

static int spc564b_setlock(struct flash_bank *bank, uint32_t block_space, uint32_t lock_state)
{
	int err;
	uint32_t pass;
	struct target *target = bank->target;
	struct spc564b_flash_bank *spc564b_info = bank->driver_priv;
	struct working_area *ssd_config;
	struct working_area *setlock_algorithm;
	struct reg_param reg_params[6];
	struct powerpc_algorithm powerpc_info;
	SSD_CONFIG *ssd = &spc564b_info->ssd;

	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
		return err;

	/* Flash erase code */
	if (target_alloc_working_area(target, sizeof(spc56x_flash_setlock_code),
			&setlock_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash erase step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, setlock_algorithm->address,
			sizeof(spc56x_flash_setlock_code), (uint8_t *)spc56x_flash_setlock_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, setlock_algorithm);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

	init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
	buf_set_u32(reg_params[1].value, 0, 32, block_space);

	init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
	buf_set_u32(reg_params[2].value, 0, 32, lock_state);

	if ((block_space == LOCK_LOW_PRIMARY) || (block_space == LOCK_MID_PRIMARY))
	{
		pass = FLASH_LMLR_PASSWORD;
	}
	else if ((block_space == LOCK_LOW_SECONDARY) || (block_space == LOCK_MID_SECONDARY))
	{
		pass = FLASH_SLMLR_PASSWORD;
	}
	else if (block_space == LOCK_HIGH)
	{
		pass = FLASH_HLR_PASSWORD;
	}
	else
	{
		pass = 0x0;
	}


	init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
	buf_set_u32(reg_params[3].value, 0, 32, pass);

	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[4], "lr", 32, PARAM_IN);
	buf_set_u32(reg_params[4].value, 0, 32, setlock_algorithm->address + (sizeof(spc56x_flash_setlock_code) - 2));

	init_reg_param(&reg_params[5], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[5].value, 0, 32, target->working_area_phys + target->working_area_size - 1);


