STMicroelectronics/OpenOCD/src/flash/nor/spc564b.c
		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

		/* dest */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, bank->base + offset + (chunk_number * chunk_size));
		/* buf_set_u32(reg_params[2].value, 0, 32, 0xFC0000); */

		/* size */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
		buf_set_u32(reg_params[2].value, 0, 32, bytes_remain);

		/* source */
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
		buf_set_u32(reg_params[3].value, 0, 32, source->address);

		/* CallBack */
		init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);
		buf_set_u32(reg_params[4].value, 0, 32, 0xFFFFFFFF);

		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[5], "lr", 32, PARAM_IN);	/* lr */
		buf_set_u32(reg_params[5].value, 0, 32, write_algorithm->address +(sizeof(spc56x_flash_write_code) - 2));

		init_reg_param(&reg_params[6], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[6].value, 0, 32, target->working_area_phys + target->working_area_size);


		err = target_run_algorithm(target,
				0, NULL,
				7, reg_params,
				write_algorithm->address, (write_algorithm->address + write_algorithm->size),
				2000000000, &powerpc_info);


		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);

		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			goto flash_write_error;
		}
	}

	err = target_read_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);

	if (err != ERROR_OK)
	{
		err = ERROR_TARGET_FAILURE;
	}

	target_free_working_area(target, source);
	target_free_working_area(target, write_algorithm);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);
	destroy_reg_param(&reg_params[5]);
	destroy_reg_param(&reg_params[6]);

flash_write_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);

	return err;
}


static void setup_sector(struct flash_bank *bank, unsigned int start, unsigned int num, unsigned int size)
{
	unsigned int i;
	for (i = start; i < (start + num) ; i++) {
		assert(i < bank->num_sectors);
		bank->sectors[i].offset = bank->size;
		bank->sectors[i].size = size;
		bank->size += bank->sectors[i].size;
	}
}

static int spc564b_probe(struct flash_bank *bank)
{
	struct spc564b_flash_bank *spc564b_info = bank->driver_priv;
	struct target *target = bank->target;
	struct working_area *ssd_config;
	struct working_area *init_algorithm;
	struct reg_param reg_params[3];
	struct powerpc_algorithm powerpc_info;
	SSD_CONFIG *ssd = &spc564b_info->ssd;


	int i;
	int err;
	uint16_t flash_size_in_kb = 0;

	int num_pages;

	num_pages = 0;

	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);

	spc564b_info->probed = 0;

	/* The user sets the size manually */
	if (spc564b_info->user_bank_size) {
		LOG_DEBUG("ignoring flash probed value, using configured bank size");
		flash_size_in_kb = spc564b_info->user_bank_size / 1024;
	}

	LOG_INFO("flash: %d kbytes @ 0x%08x", flash_size_in_kb, spc564b_info->user_bank_addr);


	/* did we assign flash size? */
	assert(flash_size_in_kb != 0xffff);

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	/* Default SSD values (keep them in target endianess) */
	uint32_t val;

	if(bank->base == 0x0)
	{
		val = C90FL_C0_REG_BASE;
		ssd->c90flRegBase = fast_target_buffer_get_u32(&val, false);

		val = C0_ARRAY_BASE;
		ssd->mainArrayBase = fast_target_buffer_get_u32(&val, false);

		val = SHADOW_ROW_BASE;
		ssd->shadowRowBase = fast_target_buffer_get_u32(&val, false);

		val = SHADOW_ROW_SIZE;
		ssd->shadowRowSize = fast_target_buffer_get_u32(&val, false);

		val = C90FL_PAGE_SIZE;
		ssd->pageSize = fast_target_buffer_get_u32(&val, false);
	} else if(bank->base == 0x180000)
	{
		val = C90FL_C1_REG_BASE;
		ssd->c90flRegBase = fast_target_buffer_get_u32(&val, false);

		val = C1_ARRAY_BASE;
		ssd->mainArrayBase = fast_target_buffer_get_u32(&val, false);

		val = C90FL_PAGE_SIZE;
		ssd->pageSize = fast_target_buffer_get_u32(&val, false);
	} else if(bank->base == 0x800000)
	{
		val = C90FL_DATA_REG_BASE;
		ssd->c90flRegBase = fast_target_buffer_get_u32(&val, false);

		val = DATA_ARRAY_BASE;
		ssd->mainArrayBase = fast_target_buffer_get_u32(&val, false);

		val = C90FL_PAGE_SIZE_04;
		ssd->pageSize = fast_target_buffer_get_u32(&val, false);
	}

	ssd->lowBlockNum = 0;
	ssd->midBlockNum = 0;
	ssd->highBlockNum = 0;

	ssd->BDMEnable = 0;

	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
	{
		target_free_working_area(target, ssd_config);
		return err;
	}


	/* Flash initialization code */
	if (target_alloc_working_area(target, sizeof(spc56x_flash_init_code),
			&init_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash init step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, init_algorithm->address,
			sizeof(spc56x_flash_init_code), (uint8_t *)spc56x_flash_init_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, init_algorithm);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

