STMicroelectronics/OpenOCD/src/flash/nor/spc564b.c
	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[1], "lr", 32, PARAM_IN);
	//buf_set_u32(reg_params[1].value, 0, 32, init_algorithm->address + (init_algorithm->size - 2));
	buf_set_u32(reg_params[1].value, 0, 32, init_algorithm->address + (sizeof(spc56x_flash_init_code) - 2));
	//buf_set_u32(reg_params[1].value, 0, 32, 0x400a8164);

	/*
	* Stack Pointer (in).
	*/
	init_reg_param(&reg_params[2], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[2].value, 0, 32, target->working_area_phys + target->working_area_size - 1);

	err = target_run_algorithm(target,
			0, NULL,
			3, reg_params,
			init_algorithm->address, (init_algorithm->address + init_algorithm->size),
			5000, &powerpc_info);

	if ((err != ERROR_OK) || (buf_get_u32(reg_params[0].value, 0, 32) != 0)) {
		err = ERROR_TARGET_FAILURE;
		goto flash_init_error;
	}

	err = target_read_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK) {
		goto flash_init_error;
	}

	LOG_DEBUG("SDD->c90flRegBase  = 0x%08x", fast_target_buffer_get_u32(&ssd->c90flRegBase, false));
	LOG_DEBUG("SDD->mainArrayBase = 0x%08x", fast_target_buffer_get_u32(&ssd->mainArrayBase, false));
	LOG_DEBUG("SDD->shadowRowBase = 0x%08x", fast_target_buffer_get_u32(&ssd->shadowRowBase, false));
	LOG_DEBUG("SDD->shadowRowSize = 0x%08x", fast_target_buffer_get_u32(&ssd->shadowRowSize, false));

	LOG_DEBUG("SDD->lowBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->lowBlockNum, false));
	LOG_DEBUG("SDD->midBlockNum   = 0x%08x", fast_target_buffer_get_u32(&ssd->midBlockNum, false));
	LOG_DEBUG("SDD->highBlockNum  = 0x%08x", fast_target_buffer_get_u32(&ssd->highBlockNum, false));

	LOG_DEBUG("SDD->pageSize   = 0x%08x", fast_target_buffer_get_u32(&ssd->pageSize, false));
	LOG_DEBUG("SDD->BDMEnable     = 0x%u", ssd->BDMEnable);


	/* calculate numbers of pages */
	/* int num_pages = fast_target_buffer_get_u32(&ssd->lowBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n128KBlockNum, false);
	num_pages = num_pages + fast_target_buffer_get_u32(&ssd->midBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n128KBlockNum, false);
	num_pages = num_pages + fast_target_buffer_get_u32(&ssd->highBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n128KBlockNum, false);
	num_pages = num_pages + fast_target_buffer_get_u32(&ssd->nLargeBlockNum, false);
	*/
	if(bank->base == 0x0)
	{
		num_pages = 16;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc564b_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 1, 32 * 1024);
		setup_sector(bank, 1, 2, 16 * 1024);
		setup_sector(bank, 3, 2, 32 * 1024);
		setup_sector(bank, 5, 1, 128 * 1024);

		// Mid Flash Blocks
		setup_sector(bank, 6, 2, 128 * 1024);

		// High Flash Blocks
		setup_sector(bank, 8, 8, 128 * 1024);

		spc564b_info->low_max_index = 6;
		spc564b_info->mid_max_index = 8;
		spc564b_info->high_max_index = 16;
		
	} else if(bank->base == 0x180000)
	{
		num_pages = 16;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc564b_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 1, 32 * 1024);
		setup_sector(bank, 1, 2, 16 * 1024);
		setup_sector(bank, 3, 2, 32 * 1024);
		setup_sector(bank, 5, 1, 128 * 1024);

		// Mid Flash Blocks
		setup_sector(bank, 6, 2, 128 * 1024);

		// High Flash Blocks
		setup_sector(bank, 8, 8, 128 * 1024);

		spc564b_info->low_max_index = 6;
		spc564b_info->mid_max_index = 8;
		spc564b_info->high_max_index = 16;

		bank->sectors[0].offset = 0x100000;
		bank->sectors[1].offset = 0x108000;
		bank->sectors[2].offset = 0x10C000;
		bank->sectors[3].offset = 0x110000;
		bank->sectors[4].offset = 0x118000;
		bank->sectors[5].offset = 0x120000;
		bank->sectors[6].offset = 0x140000;
		bank->sectors[7].offset = 0x160000;

		bank->sectors[8].offset = 0x0;
		bank->sectors[9].offset = 0x20000;
		bank->sectors[10].offset = 0x40000;
		bank->sectors[11].offset = 0x60000;
		bank->sectors[12].offset = 0x80000;
		bank->sectors[13].offset = 0xA0000;
		bank->sectors[14].offset = 0xC0000;
		bank->sectors[15].offset = 0xE0000;

	} else if(bank->base == 0x800000)
	{
		num_pages = 4;

		/* check that calculation result makes sense */
		assert(num_pages > 0);

		if (bank->sectors) {
			free(bank->sectors);
			bank->sectors = NULL;
		}

		bank->base = spc564b_info->user_bank_addr;
		bank->num_sectors = num_pages;
		bank->sectors = malloc(sizeof(struct flash_sector) * num_pages);
		bank->size = 0;

		// Low Flash Blocks
		setup_sector(bank, 0, 4, 16 * 1024);

		spc564b_info->low_max_index = 4;
		spc564b_info->large_max_index = 0;
		spc564b_info->high_max_index = 0;
		spc564b_info->mid_max_index = 0;
	}



	for (i = 0; i < num_pages; i++) {
		bank->sectors[i].is_erased = -1;
		bank->sectors[i].is_protected = 0;
	}


	/* Save flash geometry (in sectors) */
/*
	spc564b_info->low_max_index = fast_target_buffer_get_u32(&ssd->lowBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->lowBlockInfo.n128KBlockNum, false);
	spc564b_info->large_max_index = spc564b_info->low_max_index +  fast_target_buffer_get_u32(&ssd->nLargeBlockNum, false);
	spc564b_info->high_max_index = spc564b_info->large_max_index + fast_target_buffer_get_u32(&ssd->highBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->highBlockInfo.n128KBlockNum, false);
	spc564b_info->mid_max_index = spc564b_info->high_max_index + fast_target_buffer_get_u32(&ssd->midBlockInfo.n16KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n32KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n64KBlockNum, false) + fast_target_buffer_get_u32(&ssd->midBlockInfo.n128KBlockNum, false);
*/



	/* Done */
	spc564b_info->probed = 1;


flash_init_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);
	target_free_working_area(target, init_algorithm);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);

	return err;
}

static int spc564b_auto_probe(struct flash_bank *bank)
{
	struct spc564b_flash_bank *spc564b_info = bank->driver_priv;

	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	if (spc564b_info->probed)
		return ERROR_OK;
	return spc564b_probe(bank);
}


static int get_spc564b_info(struct flash_bank *bank, struct command_invocation *cmd)
{
	LOG_DEBUG("%s:%d %s()",
		__FILE__, __LINE__, __func__);

	/* TODO: retrieve the right info */
	//snprintf(buf, buf_size, "SPC560B - Rev: xx");

	return ERROR_OK;
}


struct flash_driver spc564b_flash = {
	.name = "spc564b",
	.flash_bank_command = spc564b_flash_bank_command,
	.erase = spc564b_erase,
	.protect = spc564b_protect,
	.write = spc564b_write,
	.read = default_flash_read,
	.probe = spc564b_probe,
	.auto_probe = spc564b_auto_probe,
	.erase_check = default_flash_blank_check,
	.protect_check = spc564b_protect_check,
	.info = get_spc564b_info,
};
